{"class_name": "Model", "config": {"name": "model_841", "layers": [{"name": "input_841", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 4], "dtype": "float32", "sparse": false, "name": "input_841"}, "inbound_nodes": []}, {"name": "lambda_2273", "class_name": "Lambda", "config": {"name": "lambda_2273", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAcy4AAAB0AGoBfABkAWQBZwKIAGQCGACIAGQCGABnAmQBZAFn\nAmcDZANkAGQEZAWNBVMAKQZO6QAAAADpAQAAANoIQ09OU1RBTlTnAAAAAAAA0D8pA9oEbW9kZdoE\nbmFtZdoPY29uc3RhbnRfdmFsdWVzKQLaAnRm2gNwYWQpAdoBeCkB2gxkZXRlY3Rvcl9sZW6pAPoe\nPGlweXRob24taW5wdXQtNS1jZWRkMWFkOWI4NjE+2gtzZXFfcGFkZGluZy4AAABzDgAAAAABBgEG\nAQ4BCAECAQIB\n", null, [24]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["input_841", 0, 0, {}]]]}, {"name": "lambda_2274", "class_name": "Lambda", "config": {"name": "lambda_2274", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAYAAABTAAAAcx4AAAB8AGQAZACFAmQAZABkAoUDZABkAGQDhQNmAxkAUwAp\nBE7pAQAAAOn/////cgIAAACpACkB2gF4cgMAAAByAwAAAPoePGlweXRob24taW5wdXQtNS1jZWRk\nMWFkOWI4NjE+2gg8bGFtYmRhPk4AAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["lambda_2273", 0, 0, {}]]]}, {"name": "conv1d_841", "class_name": "Conv1D", "config": {"name": "conv1d_841", "trainable": true, "filters": 16, "kernel_size": [24], "strides": [1], "padding": "valid", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_2273", 0, 0, {}]], [["lambda_2274", 0, 0, {}]]]}, {"name": "max_pooling1d_1433", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_1433", "trainable": true, "strides": [1], "pool_size": [59], "padding": "valid"}, "inbound_nodes": [[["conv1d_841", 0, 0, {}]]]}, {"name": "max_pooling1d_1434", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_1434", "trainable": true, "strides": [1], "pool_size": [59], "padding": "valid"}, "inbound_nodes": [[["conv1d_841", 1, 0, {}]]]}, {"name": "time_distributed_2011", "class_name": "TimeDistributed", "config": {"name": "time_distributed_2011", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_1217", "trainable": true, "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["max_pooling1d_1433", 0, 0, {}]]]}, {"name": "time_distributed_2012", "class_name": "TimeDistributed", "config": {"name": "time_distributed_2012", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_1217", "trainable": true, "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["max_pooling1d_1434", 0, 0, {}]]]}, {"name": "lambda_2275", "class_name": "Lambda", "config": {"name": "lambda_2275", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAQAAABTAAAAcxoAAAB0AGoBfABkAWQCjQJkAGQAhQJkA2YCGQBTACkETukB\nAAAAKQHaBGF4aXPpAAAAACkC2gJ0ZtoKcmVkdWNlX21heCkB2gF4qQByBwAAAPoePGlweXRob24t\naW5wdXQtNS1jZWRkMWFkOWI4NjE+2gg8bGFtYmRhPlwAAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": ["4wEAAAAAAAAAAQAAAAIAAABTAAAAcwQAAABkAlMAKQNO6QEAAACpAk5yAQAAAKkAKQHaAXhyAwAA\nAHIDAAAA+h48aXB5dGhvbi1pbnB1dC01LWNlZGQxYWQ5Yjg2MT7aCDxsYW1iZGE+XQAAAHMAAAAA\n", null, null], "output_shape_type": "lambda", "arguments": {}}, "inbound_nodes": [[["time_distributed_2011", 0, 0, {}]], [["time_distributed_2012", 0, 0, {}]]]}, {"name": "maximum_593", "class_name": "Maximum", "config": {"name": "maximum_593", "trainable": true}, "inbound_nodes": [[["lambda_2275", 0, 0, {}], ["lambda_2275", 1, 0, {}]]]}], "input_layers": [["input_841", 0, 0]], "output_layers": [["maximum_593", 0, 0]]}, "keras_version": "2.1.5", "backend": "tensorflow"}