{"class_name": "Model", "keras_version": "1.2.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1000, 4], "input_dtype": "float32", "sparse": false, "name": "data/genome_data_dir"}, "inbound_nodes": [], "name": "data/genome_data_dir"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_1", "activity_regularizer": null, "trainable": true, "filter_length": 19, "init": "glorot_uniform", "bias": true, "nb_filter": 300, "input_dim": null, "subsample_length": 1, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "input_length": null}, "inbound_nodes": [[["data/genome_data_dir", 0, 0]]], "name": "convolution1d_1"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_1", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["convolution1d_1", 0, 0]]], "name": "batchnormalization_1"}, {"class_name": "PReLU", "config": {"init": "zero", "trainable": true, "name": "prelu_1"}, "inbound_nodes": [[["batchnormalization_1", 0, 0]]], "name": "prelu_1"}, {"class_name": "MaxPooling1D", "config": {"stride": 3, "pool_length": 3, "trainable": true, "name": "maxpooling1d_1", "border_mode": "valid"}, "inbound_nodes": [[["prelu_1", 0, 0]]], "name": "maxpooling1d_1"}, {"class_name": "Convolution1D", "config": {"W_constraint": {"m": 7, "name": "MaxNorm", "axis": 0}, "b_constraint": null, "name": "convolution1d_2", "activity_regularizer": null, "trainable": true, "filter_length": 11, "init": "glorot_uniform", "bias": true, "nb_filter": 200, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "input_length": null}, "inbound_nodes": [[["maxpooling1d_1", 0, 0]]], "name": "convolution1d_2"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_2", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["convolution1d_2", 0, 0]]], "name": "batchnormalization_2"}, {"class_name": "PReLU", "config": {"init": "zero", "trainable": true, "name": "prelu_2"}, "inbound_nodes": [[["batchnormalization_2", 0, 0]]], "name": "prelu_2"}, {"class_name": "MaxPooling1D", "config": {"stride": 4, "pool_length": 4, "trainable": true, "name": "maxpooling1d_2", "border_mode": "valid"}, "inbound_nodes": [[["prelu_2", 0, 0]]], "name": "maxpooling1d_2"}, {"class_name": "Convolution1D", "config": {"W_constraint": {"m": 7, "name": "MaxNorm", "axis": 0}, "b_constraint": null, "name": "convolution1d_3", "activity_regularizer": null, "trainable": true, "filter_length": 7, "init": "glorot_uniform", "bias": true, "nb_filter": 200, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "input_length": null}, "inbound_nodes": [[["maxpooling1d_2", 0, 0]]], "name": "convolution1d_3"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_3", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["convolution1d_3", 0, 0]]], "name": "batchnormalization_3"}, {"class_name": "PReLU", "config": {"init": "zero", "trainable": true, "name": "prelu_3"}, "inbound_nodes": [[["batchnormalization_3", 0, 0]]], "name": "prelu_3"}, {"class_name": "MaxPooling1D", "config": {"stride": 4, "pool_length": 4, "trainable": true, "name": "maxpooling1d_3", "border_mode": "valid"}, "inbound_nodes": [[["prelu_3", 0, 0]]], "name": "maxpooling1d_3"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}, "inbound_nodes": [[["maxpooling1d_3", 0, 0]]], "name": "flatten_1"}, {"class_name": "Dense", "config": {"W_constraint": {"m": 7, "name": "MaxNorm", "axis": 0}, "b_constraint": null, "name": "dense_1", "activity_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 9.999999747378752e-06}, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 4000, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 1000}, "inbound_nodes": [[["flatten_1", 0, 0]]], "name": "dense_1"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_4", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["dense_1", 0, 0]]], "name": "batchnormalization_4"}, {"class_name": "PReLU", "config": {"init": "zero", "trainable": true, "name": "prelu_4"}, "inbound_nodes": [[["batchnormalization_4", 0, 0]]], "name": "prelu_4"}, {"class_name": "Dropout", "config": {"p": 0.3, "trainable": true, "name": "dropout_1"}, "inbound_nodes": [[["prelu_4", 0, 0]]], "name": "dropout_1"}, {"class_name": "Dense", "config": {"W_constraint": {"m": 7, "name": "MaxNorm", "axis": 0}, "b_constraint": null, "name": "dense_2", "activity_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 9.999999747378752e-06}, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 1000, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 1000}, "inbound_nodes": [[["dropout_1", 0, 0]]], "name": "dense_2"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_5", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["dense_2", 0, 0]]], "name": "batchnormalization_5"}, {"class_name": "PReLU", "config": {"init": "zero", "trainable": true, "name": "prelu_5"}, "inbound_nodes": [[["batchnormalization_5", 0, 0]]], "name": "prelu_5"}, {"class_name": "Dropout", "config": {"p": 0.3, "trainable": true, "name": "dropout_2"}, "inbound_nodes": [[["prelu_5", 0, 0]]], "name": "dropout_2"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "num_tasks_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 1000, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 1}, "inbound_nodes": [[["dropout_2", 0, 0]]], "name": "num_tasks_1"}, {"class_name": "Activation", "config": {"activation": "sigmoid", "trainable": true, "name": "activation_1"}, "inbound_nodes": [[["num_tasks_1", 0, 0]]], "name": "activation_1"}], "input_layers": [["data/genome_data_dir", 0, 0]], "output_layers": [["activation_1", 0, 0]], "name": "model_1"}}